app/controllers/contributions_controller.rb

  def index
    @robot = Robot.find(params[:robot_id])
    @contributions = @robot.contributions.order(:created_at)
---
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "contributions".* FROM "contributions" WHERE "contributions"."robot_id" = $1  ORDER BY "contributions"."created_at" ASC  [["robot_id", 1]]