app/controllers/robots_controller.rb

SELECT "robots".* FROM "robots"  ORDER BY "robots"."created_at" ASC
---
  def index
    @robots = Robot.all

SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "contributions".* FROM "contributions" WHERE "contributions"."robot_id" = $1  [["robot_id", 1]]
---
  def show
    @robot = Robot.find(params[:id])
    @contributions = @robot.contributions.all

INSERT INTO "robots" ("name", "tagline", "photoUrl", "bio", "country", "rClass", "corporation", "year", "sPower", "sEnergy", "sAgility", "sArmor", "pLName", "pLNationality", "pLBattles", "pRName", "pRNationality", "pRBattles", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @robot = Robot.new(robot_params)

    if @robot.save

SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "robots" SET "photoUrl" = $1, "updated_at" = $2 WHERE "robots"."id" = $3  [["photoUrl", "http://www.placecage.com/600/200"], ["updated_at", "2016-08-26 16:22:33.450504"], ["id", 8]]
---
  def update
    @robot = Robot.find(params[:id])
    if @robot.update(robot_params)

SELECT  "robots".* FROM "robots" WHERE "robots"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "robots" WHERE "robots"."id" = $1  [["id", 8]]
---
  def destroy
    @robot = Robot.find(params[:id])
    if @robot.destroy